html/scheme/tutorial/function.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>定义函数</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="pair_list.html"> UP </a>
 |
 <a accesskey="H" href="slt.html"> HOME </a>
</div><div id="content">
<h1 class="title">定义函数</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org22fc86c">定义简单函数</a></li>
<li><a href="#org7482d12">定义有参数的函数</a></li>
<li><a href="#org5c180e0">简化函数定义</a></li>
</ul>
</div>
</div>
<p>
在本章中，会讲解如何 <b>自定义函数</b> 。由于Sheme是函数式编程语言，需要通过编写小型函数来构造程序。因此，明白如何构造并组合这些函数对掌握Scheme尤为关键
</p>

<p>
在前端定义函数非常不便，因此通常需要在文本编辑器中编辑好代码，并在解释器中加载它们
</p>
<div id="outline-container-org22fc86c" class="outline-2">
<h2 id="org22fc86c">定义简单函数</h2>
<div class="outline-text-2" id="text-org22fc86c">
<p>
可以使用 <span class="underline">define</span> 来将一个 <span class="underline">符号</span> 与一个 <span class="underline">值</span> <b>绑定</b> 。可以通过这个操作符定义例如 <span class="underline">数</span> 、 <span class="underline">字符</span> 、 <span class="underline">表</span> 、 <span class="underline">函数</span> 等 <b>任何类型的全局参数</b> 
</p>


<p>
使用任意一款编辑器来编辑下面的代码，并将它们存储为 <span class="underline">hello.scm</span> ，放置在类似于C:\doc\scheme\的文件夹下：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">Hello world as a variable</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">vhello</span> <span style="color: #deb887;">"Hello world"</span><span style="color: #696969;">)</span>    

<span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">Hello world as a function</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">fhello</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>         
         <span style="color: #deb887;">"Hello world"</span><span style="color: #696969;">))</span>
</pre>
</div>

<p>
接下来，向 Scheme解释器 输入下面的命令：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>cd <span style="color: #deb887;">"C:\\doc\\scheme"</span><span style="color: #696969;">)</span>
<span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">Value 14: #[pathname 14 "c:\\doc\\scheme\\"]</span>

<span style="color: #696969;">(</span>load <span style="color: #deb887;">"hello.scm"</span><span style="color: #696969;">)</span>
<span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">Loading "hello.scm" -- done</span>
<span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">Value: fhello</span>
</pre>
</div>

<p>
通过这些命令， <span class="underline">hello.scm</span> 就被 <b>加载到解释器</b> 中
</p>
<pre class="example">
    如果你的当前目录被设定在了脚本所在目录，那么你就不需要再输入第一行的命令了
</pre>
<p>
然后，向解释器输入下面的命令：
</p>

<div class="org-src-container">
<pre class="src src-scheme">vhello <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">"Hello world"</span>

fhello <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">#&lt;procedure:fhello&gt;</span>

<span style="color: #696969;">(</span>fhello<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">"Hello world"</span>
</pre>
</div>

<pre class="example">
    第1行中，我们声明了一个全局参数vhello，并将其与"Hello，World"绑定起来。

    第2行声明了一个返回“Hello World”的过程
</pre>

<ul class="org-ul">
<li>特殊形式 <b>define</b> 用于 <b>声明变量</b> 
<ul class="org-ul">
<li><span class="underline">define</span> 接受两个参数：define运算符会使用第一个参数作为全局参数，并将其与第二个参数绑定起来</li>
</ul></li>
<li>特殊形式 <b>lambda</b> 用于 <b>定义过程</b> 
<ul class="org-ul">
<li><span class="underline">lambda</span> 需要至少一个的参数：第一个参数是由 <b>定义的过程所需的参数组成的表</b> 。因为本例 fhello 没有参数，所以参数表是空表</li>
</ul></li>
</ul>

<pre class="example">
在解释器中输入vhello，解释器返回“Hello，World”

如果你在解释器中输入fhello，它也会返回像下面这样的值：#&lt;procedure:fhello&gt;，这说明了Scheme解释器把过程和常规数据类型用同样的方式对待
Scheme解释器通过内存空间中的数据地址操作所有的数据，因此，所有存在于内存空间中的对象都以同样的方式处理。

如果把fhello当过程对待，你应该用括号括住这些符号，比如(fhello)：
然后解释器会按照以前讲述的规则那样对它求值，并返回“Hello World”
</pre>
</div>
</div>
<div id="outline-container-org7482d12" class="outline-2">
<h2 id="org7482d12">定义有参数的函数</h2>
<div class="outline-text-2" id="text-org7482d12">
<p>
可以通过在 <span class="underline">lambda</span> 后 <b>放一个参数表</b> 来定义有参数的函数
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">hello with name</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">hello</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>name<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span>string-append <span style="color: #deb887;">"Hello "</span> name <span style="color: #deb887;">"!"</span><span style="color: #696969;">)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">sum of three numbers</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">sum3</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>a b c<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span>+ a b c<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span>hello <span style="color: #deb887;">"Lucy"</span><span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">"Hello Lucy!"</span>

<span style="color: #696969;">(</span>sum3 10 20 30<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">60</span>
</pre>
</div>

<ul class="org-ul">
<li>函数 <span class="underline">hello</span> ：有一个参数 <span class="underline">name</span> ，并会把 "Hello" 、name的值、和 '!'连结在一起并返回</li>
<li>函数 <span class="underline">sum3</span> ：此函数有三个参数并返回这三个参数的和</li>
</ul>

<pre class="example">
    预定义函数string-append可以接受任意多个数的参数，并返回将这些参数连结在一起后的字符串
</pre>
</div>
</div>
<div id="outline-container-org5c180e0" class="outline-2">
<h2 id="org5c180e0">简化函数定义</h2>
<div class="outline-text-2" id="text-org5c180e0">
<p>
用 <span class="underline">lambda</span> 定义函数是一种规范的方法，但也可以使用下面代码展示的短形式：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">hello with name</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">hello</span> name<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>string-append <span style="color: #deb887;">"Hello "</span> name <span style="color: #deb887;">"!"</span><span style="color: #696969;">))</span>


<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">sum of three numbers</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">sum3</span> a b c<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>+ a b c<span style="color: #696969;">))</span>
</pre>
</div>

<p>
在这种形式中，函数按照它们 <b>被调用的形式</b> 被定义
</p>

<p>
<a href="branch.html">Next：分支</a>
</p>

<p>
<a href="pair_list.html">Previous：序对和列表</a>
</p>

<p>
<a href="slt.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
